bumping `1.16.5` to `1.17.4`
tf plan output
```
Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.cert_manager.helm_release.cert_manager will be updated in-place
  ~ resource "helm_release" "cert_manager" {
      ~ id                         = "cert-manager" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.16.5" -> (known after apply)
          ~ chart          = "cert-manager" -> (known after apply)
          ~ first_deployed = 1756195934 -> (known after apply)
          ~ last_deployed  = 1756195934 -> (known after apply)
          ~ name           = "cert-manager" -> (known after apply)
          ~ namespace      = "cert-manager" -> (known after apply)
          ~ notes          = <<-EOT

                cert-manager v1.16.5 has been deployed successfully!

                In order to begin issuing certificates, you will need to set up a ClusterIssuer
                or Issuer resource (for example, by creating a 'letsencrypt-staging' issuer).

                More information on the different types of issuers and how to configure them
                can be found in our documentation:

                https://cert-manager.io/docs/configuration/

                For information on how to configure cert-manager to automatically provision
                Certificates for Ingress resources, take a look at the `ingress-shim`
                documentation:

                https://cert-manager.io/docs/usage/ingress/
            EOT -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - cainjector      = {
                      - replicaCount = 1
                    }
                  - crds            = {
                      - enabled = true
                      - keep    = true
                    }
                  - ingressShim     = {
                      - defaultIssuerKind = "ClusterIssuer"
                      - defaultIssuerName = "letsencrypt-production"
                    }
                  - prometheus      = {
                      - enabled        = true
                      - servicemonitor = {
                          - enabled = true
                        }
                    }
                  - replicaCount    = 1
                  - securityContext = {
                      - fsGroup = 1001
                    }
                  - serviceAccount  = {
                      - annotations = {
                          - "eks.amazonaws.com/role-arn" = "arn:aws:iam::754256621582:role/cert-manager.cp-2608-0754.cloud-platform.service.justice.gov.uk"
                        }
                      - create      = true
                    }
                  - webhook         = {
                      - replicaCount = 1
                    }
                }
            ) -> (known after apply)
          ~ version        = "v1.16.5" -> (known after apply)
        }
        name                       = "cert-manager"
      ~ version                    = "v1.16.5" -> "v1.17.4"
        # (26 unchanged attributes hidden)
    }

  # module.cert_manager.kubectl_manifest.clusterissuers_production will be updated in-place
  ~ resource "kubectl_manifest" "clusterissuers_production" {
        id                      = "/apis/cert-manager.io/v1/clusterissuers/letsencrypt-production"
        name                    = "letsencrypt-production"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-production
            spec:
              acme:
                email: platforms@digital.justice.gov.uk
                privateKeySecretRef:
                  name: letsencrypt-production
                server: https://acme-v02.api.letsencrypt.org/directory
                solvers:
                - dns01:
                    cnameStrategy: Follow
          -         route53:
          -           region: eu-west-2
                  selector: {}
        EOT
        # (13 unchanged attributes hidden)
    }

  # module.cert_manager.kubectl_manifest.clusterissuers_staging will be updated in-place
  ~ resource "kubectl_manifest" "clusterissuers_staging" {
        id                      = "/apis/cert-manager.io/v1/clusterissuers/letsencrypt-staging"
        name                    = "letsencrypt-staging"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-staging
            spec:
              acme:
                email: platforms@digital.justice.gov.uk
                privateKeySecretRef:
                  name: letsencrypt-staging
                server: https://acme-staging-v02.api.letsencrypt.org/directory
                solvers:
                - dns01:
                    cnameStrategy: Follow
          -         route53:
          -           region: eu-west-2
                  selector: {}
        EOT
        # (13 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

tf apply error
```
module.cert_manager.helm_release.cert_manager: Modifying... [id=cert-manager]
module.cert_manager.helm_release.cert_manager: Still modifying... [id=cert-manager, 10s elapsed]
module.cert_manager.helm_release.cert_manager: Still modifying... [id=cert-manager, 20s elapsed]
module.cert_manager.helm_release.cert_manager: Modifications complete after 27s [id=cert-manager]
module.cert_manager.kubectl_manifest.clusterissuers_production: Modifying... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt-production]
module.cert_manager.kubectl_manifest.clusterissuers_staging: Modifying... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt-staging]
╷
│ Error: letsencrypt-staging failed to run apply: error when applying patch:
│ {"metadata":{"annotations":{"kubectl.kubernetes.io/last-applied-configuration":"{\"apiVersion\":\"cert-manager.io/v1\",\"kind\":\"ClusterIssuer\",\"metadata\":{\"annotations\":{},\"name\":\"letsencrypt-staging\"},\"spec\":{\"acme\":{\"email\":\"platforms@digital.justice.gov.uk\",\"privateKeySecretRef\":{\"name\":\"letsencrypt-staging\"},\"server\":\"https://acme-staging-v02.api.letsencrypt.org/directory\",\"solvers\":[{\"dns01\":{\"cnameStrategy\":\"Follow\"},\"selector\":{}}]}}}\n"}},"spec":{"acme":{"solvers":[{"dns01":{"cnameStrategy":"Follow"},"selector":{}}]}}}
│ to:
│ Resource: "cert-manager.io/v1, Resource=clusterissuers", GroupVersionKind: "cert-manager.io/v1, Kind=ClusterIssuer"
│ Name: "letsencrypt-staging", Namespace: ""
│ for: "/var/folders/dn/36h9hkkn75l3vch6_4sxs1140000gq/T/1142036098kubectl_manifest.yaml": error when patching "/var/folders/dn/36h9hkkn75l3vch6_4sxs1140000gq/T/1142036098kubectl_manifest.yaml": admission webhook "webhook.cert-manager.io" denied the request: spec.acme.solvers[0].dns01: Required value: no DNS01 provider configured
│
│   with module.cert_manager.kubectl_manifest.clusterissuers_staging,
│   on .terraform/modules/cert_manager/main.tf line 46, in resource "kubectl_manifest" "clusterissuers_staging":
│   46: resource "kubectl_manifest" "clusterissuers_staging" {
│
╵
╷
│ Error: letsencrypt-production failed to run apply: error when applying patch:
│ {"metadata":{"annotations":{"kubectl.kubernetes.io/last-applied-configuration":"{\"apiVersion\":\"cert-manager.io/v1\",\"kind\":\"ClusterIssuer\",\"metadata\":{\"annotations\":{},\"name\":\"letsencrypt-production\"},\"spec\":{\"acme\":{\"email\":\"platforms@digital.justice.gov.uk\",\"privateKeySecretRef\":{\"name\":\"letsencrypt-production\"},\"server\":\"https://acme-v02.api.letsencrypt.org/directory\",\"solvers\":[{\"dns01\":{\"cnameStrategy\":\"Follow\"},\"selector\":{}}]}}}\n"}},"spec":{"acme":{"solvers":[{"dns01":{"cnameStrategy":"Follow"},"selector":{}}]}}}
│ to:
│ Resource: "cert-manager.io/v1, Resource=clusterissuers", GroupVersionKind: "cert-manager.io/v1, Kind=ClusterIssuer"
│ Name: "letsencrypt-production", Namespace: ""
│ for: "/var/folders/dn/36h9hkkn75l3vch6_4sxs1140000gq/T/3095464897kubectl_manifest.yaml": error when patching "/var/folders/dn/36h9hkkn75l3vch6_4sxs1140000gq/T/3095464897kubectl_manifest.yaml": admission webhook "webhook.cert-manager.io" denied the request: spec.acme.solvers[0].dns01: Required value: no DNS01 provider configured
│
│   with module.cert_manager.kubectl_manifest.clusterissuers_production,
│   on .terraform/modules/cert_manager/main.tf line 55, in resource "kubectl_manifest" "clusterissuers_production":
│   55: resource "kubectl_manifest" "clusterissuers_production" {
│
╵
```